package com.yuhang.novel.pirate.repository.network.data.kanshu.result;

import java.util.List;

public class KanShuRankingResult {

    /**
     * status : 1
     * info : success
     * data : {"BookList":[{"Id":8975,"Name":"全职法师","Author":"乱","Img":"quanzhifashi.jpg","Desc":"一觉醒来，世界大变。\r\n　　\r\n　　    熟悉的高中传授的是魔法，告诉大家要成为一名出色的魔法师。\r\n　　\r\n　　    居住的都市之外游荡着袭击人类的魔物妖兽，虎视眈眈。\r\n　　\r\n　　    崇尚科学的世界变成了崇尚魔法，偏偏有着一样以学渣看待自己的老师，一样目光异样的同学，一样社会底层挣扎的爸爸，一样纯美却不能走路的非血缘妹妹\u2026\u2026\r\n　　\r\n　　    不过，莫凡发现绝大多数人都只能够主修一系魔法，自己却","CName":"玄幻奇幻","Score":8.9},{"Id":412435,"Name":"第一序列","Author":"会说话的肘子","Img":"diyixulie.jpg","Desc":"这是任小粟大魔王出现了吗？画风都不带变的吗？是新一代话题终结者吗？肘星人准备好了吗？想知道大魔王是如何练成的吗？让我们在2019年4月15日一起迎接新的世界吧，看看肘子如何喷翻全场！！","CName":"玄幻奇幻","Score":8.6},{"Id":147613,"Name":"轮回乐园","Author":"那一只蚊子","Img":"lunhuileyuan.jpg","Desc":"机遇与危险共存，只要豁出性命，在轮回乐园中就能得到一切。\r\n　　被轮回乐园选中成为猎杀者的那一刻，苏晓就明白，他将与所有人为敌。\r\n　　乐园虽然残酷，但无所不能\u2026\u2026。","CName":"玄幻奇幻","Score":9},{"Id":292949,"Name":"我有一座恐怖屋","Author":"我会修空调","Img":"woyouyizuokongbuwu.jpg","Desc":"散发异味的灵车停在了门口，天花板传来弹珠碰撞的声音，走廊里有人来回踱步，隔壁房间好像在切割什么东西。\r\n　　卧室的门锁轻轻颤动，卫生间里水龙头已经拧紧，却还是滴答滴答个不停。\r\n　　床底下隐隐约约，似乎有个皮球滚来滚去。\r\n　　一个个沾染水渍的脚印不断在地板上浮现，正慢慢逼近。\r\n　　凌晨三点，陈歌握着菜刀躲在暖气片旁边，手里的电话刚刚拨通。\r\n　　\u201c房东！这就是你说的晚上有点热闹？！\u201d","CName":"科幻灵异","Score":9.5},{"Id":214602,"Name":"伏天氏","Author":"净无痕","Img":"futianshi.jpg","Desc":"心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！东方神州，有人皇立道统，有圣贤宗门传道，有诸侯雄踞一方王国，诸强林立，神州动乱千万载，值此之时，一代天骄叶青帝及东凰大帝横空出世，斩人皇，驭圣贤，诸侯臣服，东方神州一统！然，叶青帝忽然暴毙，世间雕像尽皆被毁，于世间除名，沦为禁忌；从此神州唯东凰大帝独尊！十五年后，东海青州城，一名为叶伏天的少年，开启了他的传奇之路\u2026","CName":"玄幻奇幻","Score":8.9},{"Id":346494,"Name":"九星毒奶","Author":"育","Img":"jiuxingdunai.jpg","Desc":"这是一个充满了星力的平行世界。\r\n　　星图、星技、星宠、觉醒者大行其道。\r\n　　魂穿而来的江晓，体内蕴含着一张奇特的内视星图，成为一名稀有的医疗系觉醒者。\r\n　　他本想成为一只快乐的大奶，但却被众人冠上了毒奶之名。\r\n　　这一切的故事，\r\n　　从高中入学的前一周开始。\r\n　　要从......那一巴掌开始说起......\r\n　　**沉重的故事写累了，写点轻松搞笑的。**\r\n　　**已完结4本小说，5","CName":"科幻灵异","Score":8.1},{"Id":481532,"Name":"魔临","Author":"纯洁滴小龙","Img":"molin.jpg","Desc":"这个世界一直流传着这样子的一个传说：\r\n　　终有一日，魔王会降临于这个世界，魔王的麾下，有七尊恐怖的魔头，他们，将带给这个世界绝望的黑暗。","CName":"玄幻奇幻","Score":9.2},{"Id":251116,"Name":"黑夜玩家","Author":"幼儿园一把手","Img":"heiyewanjia.jpg","Desc":"这个世界，并没有我们想象中的那么简单。\r\n　　妖、魔、鬼、怪\u2026\u2026这些东西真实存在，并已融入到了我们的生活之中。\r\n　　特别是在黑夜里，它们不稳定的一面将会被放大。\r\n　　白天属于人类，而夜晚\u2026\u2026属于它们！\r\n　　某组织应运而生。\r\n　　\u201c少年郎，加入我们，为建设和谐社会奉献一份光和热吧！\u201d\u2014\u2014守夜人。\r\n　　\u2026\u2026\r\n　　【本书偏日常向，已有高订1.4万精品完本作品《调戏文娱》，质量有保证，欢迎品尝","CName":"都市言情","Score":9.8},{"Id":482139,"Name":"我师兄实在太稳健了","Author":"言归正传","Img":"woshixiongshizaitaiwenjianle.jpg","Desc":"重生在封神大战之前的上古时代，李长寿成了一个小小的炼气士，没有什么气运加身，也不是什么注定的大劫之子，他只有一个想要长生不老的修仙梦。\r\n　　为了能在残酷的洪荒安身立命，他努力不沾因果，杀人必扬其灰，凡事谋而后动，从不轻易步入危险之中。\r\n　　藏底牌，修遁术，炼丹毒，掌神通，不动稳如老狗，一动石破天惊，动后悄声走人。\r\n　　本来李长寿规划中，自己会一直躲在山中平安无事的修行成仙，直到有一年，他的老","CName":"武侠仙侠","Score":9.2},{"Id":467491,"Name":"沧元图","Author":"我吃西红柿","Img":"cangyuantu.jpg","Desc":"我叫孟川，今年十五岁，是东宁府\u201c镜湖道院\u201d的当代大师兄。","CName":"玄幻奇幻","Score":8.8},{"Id":140456,"Name":"超神机械师","Author":"齐佩甲","Img":"chaoshenjixieshi.jpg","Desc":"韩萧，《星海》骨灰级代练，被来自东（zuo）方(zhe)的神秘力量扔进穿越大军，携带玩家面板变成NPC，回到《星海》公测之前，毅然选择难度最高的机械系。\r\n　　战舰列队纵横星海，星辰机甲夭矫如龙，幽能炮毁天灭地，还有无边无际的机械大军，静静待在随身仓库里。\r\n　　一人，即是军团！\r\n　　如果不是玩家出现，本书就是正经严肃的穿越异界题材\u2026\u2026\r\n　　作为NPC，正常NPC对玩家功能一应俱全\u2026\u2026发布任务","CName":"网游竞技","Score":9.4},{"Id":146769,"Name":"剑来","Author":"烽火戏诸侯","Img":"jianlai.jpg","Desc":"大千世界，无奇不有。我陈平安，唯有一剑，可搬山，倒海，降妖，镇魔，敕神，摘星，断江，摧城，开天！","CName":"玄幻奇幻","Score":9.2},{"Id":439117,"Name":"生活系神豪","Author":"起酥面包","Img":"shenghuoxishenhao.jpg","Desc":"人在贫穷的时候，呼吸都是错的。\r\n　　叮，恭喜宿主，你的每一次呼吸都会获得一定的金钱。\r\n　　叮，你吃到一只味道爆炸的小龙虾，获得一张辣味消费卡。\r\n　　叮，今天你的睡眠质量非常高，获得精力+20%的一日buff。\r\n　　不一样的神豪系统，生活中的一切都会带来惊喜。\r\n　　教练，我要学飙车！","CName":"都市言情","Score":7},{"Id":3230,"Name":"逆天邪神","Author":"火星引力","Img":"nitianxieshen.jpg","Desc":"掌天毒之珠，承邪神之血，修逆天之力，一代邪神，君临天下！【添加微信公众号：火星引力】【我们的YY频道：49554】......","CName":"玄幻奇幻","Score":8.4},{"Id":333522,"Name":"转生眼中的火影世界","Author":"空想之龙","Img":"zhuanshengyanzhongdehuoyingshijie.jpg","Desc":"战战兢兢的日向镜，终于得到了梦寐以求的宝物...\r\n　　在宝蓝色的转生眼中，火影的世界究竟是什么样的呢？","CName":"玄幻奇幻","Score":9.4},{"Id":416330,"Name":"我只想安静地打游戏","Author":"十二翼黑暗炽天使","Img":"wozhixianganjingdidayouxi.jpg","Desc":"一滴血一条命，别人打游戏爆肝，我打游戏爆血。\r\n　　次元风暴降临，地球四处出现了大量的异次元领域，仙、佛、恶魔、天使、精灵等各种异次元生物降临地球。\r\n　　而那些神秘的异次元领域，却都变成了手机游戏副本，别人拿命去冒险，我却拼命打游戏。\r\n　　已完本小说《超级神基因》730万《剑装》300万《神品道圣》160万。","CName":"玄幻奇幻","Score":8.5},{"Id":480759,"Name":"出道就是巅峰怎么办","Author":"杯中红茶","Img":"chudaojiushidianfengzenmeban.jpg","Desc":"重生睁开眼发现自己竟然穿越到平行世界落魄冠军中单的身上，而且最糟糕的是马上要上场打比赛了！？作为一条遨游在黑铁的咸鱼，却要面对一群职业选手，余乐感觉压力很大。\u201c叮，您的新手大礼包已到账，请注意查收！\u201d然而他发现别人眼中的巅峰，只是他一个微不足道的起点。最厉害的影帝，最赚钱的导演，最年轻的首","CName":"网游竞技","Score":7.7},{"Id":474163,"Name":"从我是特种兵开始打卡","Author":"纳兰凌云","Img":"congwoshitezhongbingkaishidaka.jpg","Desc":"穿越到《我是特种兵》的世界，得到辅助引擎的支持，他逐步成为所有士兵的王，特种兵，通信兵，飞行员等等，在每一个兵种的领域他都做到了极致，成为当之无愧所有士兵的王！","CName":"历史军事","Score":6},{"Id":472802,"Name":"一不小心就无敌啦","Author":"新丰","Img":"yibuxiaoxinjiuwudila.jpg","Desc":"简介：我叫林凡，我穿越了，我要修仙，法力无边。","CName":"武侠仙侠","Score":8.8},{"Id":441590,"Name":"我的细胞监狱","Author":"穿黄衣的阿肥","Img":"wodexibaojianyu.jpg","Desc":"重生为细胞，携狱典之力，来到旧神注视下的平行世界。\r\n　　蒸汽文明、命运点数、惊悚空间、异魔鬼怪、旧神信徒\u2026\u2026\r\n　　他将以狱长之名，踏上征战旧神的旅途。\r\n　　阿肥回归正途后的全新科幻惊悚力作，质量保证。\r\n　　本书又名《从头开始》-【开局一颗头，身体全靠捡】","CName":"科幻灵异","Score":9.3},{"Id":465277,"Name":"烂柯棋缘","Author":"真费事","Img":"lankeqiyuan.jpg","Desc":"烂柯旁棋局落叶，老树间对弈无人\r\n　　兴所致天元一子，再回首山海苍茫\r\n　　\u2026\u2026\r\n　　一觉醒来，计缘成了一个破旧山神庙中的半瞎乞丐。\r\n　　实力不够嘴炮来凑，真人一柄剑，神棍一张嘴，就是计缘在这个可怕的世界安身立足的根本。","CName":"武侠仙侠","Score":8.8}],"Page":1,"HasNext":true}
     */

    private int status;
    private String info;
    private DataBean data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * BookList : [{"Id":8975,"Name":"全职法师","Author":"乱","Img":"quanzhifashi.jpg","Desc":"一觉醒来，世界大变。\r\n　　\r\n　　    熟悉的高中传授的是魔法，告诉大家要成为一名出色的魔法师。\r\n　　\r\n　　    居住的都市之外游荡着袭击人类的魔物妖兽，虎视眈眈。\r\n　　\r\n　　    崇尚科学的世界变成了崇尚魔法，偏偏有着一样以学渣看待自己的老师，一样目光异样的同学，一样社会底层挣扎的爸爸，一样纯美却不能走路的非血缘妹妹\u2026\u2026\r\n　　\r\n　　    不过，莫凡发现绝大多数人都只能够主修一系魔法，自己却","CName":"玄幻奇幻","Score":8.9},{"Id":412435,"Name":"第一序列","Author":"会说话的肘子","Img":"diyixulie.jpg","Desc":"这是任小粟大魔王出现了吗？画风都不带变的吗？是新一代话题终结者吗？肘星人准备好了吗？想知道大魔王是如何练成的吗？让我们在2019年4月15日一起迎接新的世界吧，看看肘子如何喷翻全场！！","CName":"玄幻奇幻","Score":8.6},{"Id":147613,"Name":"轮回乐园","Author":"那一只蚊子","Img":"lunhuileyuan.jpg","Desc":"机遇与危险共存，只要豁出性命，在轮回乐园中就能得到一切。\r\n　　被轮回乐园选中成为猎杀者的那一刻，苏晓就明白，他将与所有人为敌。\r\n　　乐园虽然残酷，但无所不能\u2026\u2026。","CName":"玄幻奇幻","Score":9},{"Id":292949,"Name":"我有一座恐怖屋","Author":"我会修空调","Img":"woyouyizuokongbuwu.jpg","Desc":"散发异味的灵车停在了门口，天花板传来弹珠碰撞的声音，走廊里有人来回踱步，隔壁房间好像在切割什么东西。\r\n　　卧室的门锁轻轻颤动，卫生间里水龙头已经拧紧，却还是滴答滴答个不停。\r\n　　床底下隐隐约约，似乎有个皮球滚来滚去。\r\n　　一个个沾染水渍的脚印不断在地板上浮现，正慢慢逼近。\r\n　　凌晨三点，陈歌握着菜刀躲在暖气片旁边，手里的电话刚刚拨通。\r\n　　\u201c房东！这就是你说的晚上有点热闹？！\u201d","CName":"科幻灵异","Score":9.5},{"Id":214602,"Name":"伏天氏","Author":"净无痕","Img":"futianshi.jpg","Desc":"心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！东方神州，有人皇立道统，有圣贤宗门传道，有诸侯雄踞一方王国，诸强林立，神州动乱千万载，值此之时，一代天骄叶青帝及东凰大帝横空出世，斩人皇，驭圣贤，诸侯臣服，东方神州一统！然，叶青帝忽然暴毙，世间雕像尽皆被毁，于世间除名，沦为禁忌；从此神州唯东凰大帝独尊！十五年后，东海青州城，一名为叶伏天的少年，开启了他的传奇之路\u2026","CName":"玄幻奇幻","Score":8.9},{"Id":346494,"Name":"九星毒奶","Author":"育","Img":"jiuxingdunai.jpg","Desc":"这是一个充满了星力的平行世界。\r\n　　星图、星技、星宠、觉醒者大行其道。\r\n　　魂穿而来的江晓，体内蕴含着一张奇特的内视星图，成为一名稀有的医疗系觉醒者。\r\n　　他本想成为一只快乐的大奶，但却被众人冠上了毒奶之名。\r\n　　这一切的故事，\r\n　　从高中入学的前一周开始。\r\n　　要从......那一巴掌开始说起......\r\n　　**沉重的故事写累了，写点轻松搞笑的。**\r\n　　**已完结4本小说，5","CName":"科幻灵异","Score":8.1},{"Id":481532,"Name":"魔临","Author":"纯洁滴小龙","Img":"molin.jpg","Desc":"这个世界一直流传着这样子的一个传说：\r\n　　终有一日，魔王会降临于这个世界，魔王的麾下，有七尊恐怖的魔头，他们，将带给这个世界绝望的黑暗。","CName":"玄幻奇幻","Score":9.2},{"Id":251116,"Name":"黑夜玩家","Author":"幼儿园一把手","Img":"heiyewanjia.jpg","Desc":"这个世界，并没有我们想象中的那么简单。\r\n　　妖、魔、鬼、怪\u2026\u2026这些东西真实存在，并已融入到了我们的生活之中。\r\n　　特别是在黑夜里，它们不稳定的一面将会被放大。\r\n　　白天属于人类，而夜晚\u2026\u2026属于它们！\r\n　　某组织应运而生。\r\n　　\u201c少年郎，加入我们，为建设和谐社会奉献一份光和热吧！\u201d\u2014\u2014守夜人。\r\n　　\u2026\u2026\r\n　　【本书偏日常向，已有高订1.4万精品完本作品《调戏文娱》，质量有保证，欢迎品尝","CName":"都市言情","Score":9.8},{"Id":482139,"Name":"我师兄实在太稳健了","Author":"言归正传","Img":"woshixiongshizaitaiwenjianle.jpg","Desc":"重生在封神大战之前的上古时代，李长寿成了一个小小的炼气士，没有什么气运加身，也不是什么注定的大劫之子，他只有一个想要长生不老的修仙梦。\r\n　　为了能在残酷的洪荒安身立命，他努力不沾因果，杀人必扬其灰，凡事谋而后动，从不轻易步入危险之中。\r\n　　藏底牌，修遁术，炼丹毒，掌神通，不动稳如老狗，一动石破天惊，动后悄声走人。\r\n　　本来李长寿规划中，自己会一直躲在山中平安无事的修行成仙，直到有一年，他的老","CName":"武侠仙侠","Score":9.2},{"Id":467491,"Name":"沧元图","Author":"我吃西红柿","Img":"cangyuantu.jpg","Desc":"我叫孟川，今年十五岁，是东宁府\u201c镜湖道院\u201d的当代大师兄。","CName":"玄幻奇幻","Score":8.8},{"Id":140456,"Name":"超神机械师","Author":"齐佩甲","Img":"chaoshenjixieshi.jpg","Desc":"韩萧，《星海》骨灰级代练，被来自东（zuo）方(zhe)的神秘力量扔进穿越大军，携带玩家面板变成NPC，回到《星海》公测之前，毅然选择难度最高的机械系。\r\n　　战舰列队纵横星海，星辰机甲夭矫如龙，幽能炮毁天灭地，还有无边无际的机械大军，静静待在随身仓库里。\r\n　　一人，即是军团！\r\n　　如果不是玩家出现，本书就是正经严肃的穿越异界题材\u2026\u2026\r\n　　作为NPC，正常NPC对玩家功能一应俱全\u2026\u2026发布任务","CName":"网游竞技","Score":9.4},{"Id":146769,"Name":"剑来","Author":"烽火戏诸侯","Img":"jianlai.jpg","Desc":"大千世界，无奇不有。我陈平安，唯有一剑，可搬山，倒海，降妖，镇魔，敕神，摘星，断江，摧城，开天！","CName":"玄幻奇幻","Score":9.2},{"Id":439117,"Name":"生活系神豪","Author":"起酥面包","Img":"shenghuoxishenhao.jpg","Desc":"人在贫穷的时候，呼吸都是错的。\r\n　　叮，恭喜宿主，你的每一次呼吸都会获得一定的金钱。\r\n　　叮，你吃到一只味道爆炸的小龙虾，获得一张辣味消费卡。\r\n　　叮，今天你的睡眠质量非常高，获得精力+20%的一日buff。\r\n　　不一样的神豪系统，生活中的一切都会带来惊喜。\r\n　　教练，我要学飙车！","CName":"都市言情","Score":7},{"Id":3230,"Name":"逆天邪神","Author":"火星引力","Img":"nitianxieshen.jpg","Desc":"掌天毒之珠，承邪神之血，修逆天之力，一代邪神，君临天下！【添加微信公众号：火星引力】【我们的YY频道：49554】......","CName":"玄幻奇幻","Score":8.4},{"Id":333522,"Name":"转生眼中的火影世界","Author":"空想之龙","Img":"zhuanshengyanzhongdehuoyingshijie.jpg","Desc":"战战兢兢的日向镜，终于得到了梦寐以求的宝物...\r\n　　在宝蓝色的转生眼中，火影的世界究竟是什么样的呢？","CName":"玄幻奇幻","Score":9.4},{"Id":416330,"Name":"我只想安静地打游戏","Author":"十二翼黑暗炽天使","Img":"wozhixianganjingdidayouxi.jpg","Desc":"一滴血一条命，别人打游戏爆肝，我打游戏爆血。\r\n　　次元风暴降临，地球四处出现了大量的异次元领域，仙、佛、恶魔、天使、精灵等各种异次元生物降临地球。\r\n　　而那些神秘的异次元领域，却都变成了手机游戏副本，别人拿命去冒险，我却拼命打游戏。\r\n　　已完本小说《超级神基因》730万《剑装》300万《神品道圣》160万。","CName":"玄幻奇幻","Score":8.5},{"Id":480759,"Name":"出道就是巅峰怎么办","Author":"杯中红茶","Img":"chudaojiushidianfengzenmeban.jpg","Desc":"重生睁开眼发现自己竟然穿越到平行世界落魄冠军中单的身上，而且最糟糕的是马上要上场打比赛了！？作为一条遨游在黑铁的咸鱼，却要面对一群职业选手，余乐感觉压力很大。\u201c叮，您的新手大礼包已到账，请注意查收！\u201d然而他发现别人眼中的巅峰，只是他一个微不足道的起点。最厉害的影帝，最赚钱的导演，最年轻的首","CName":"网游竞技","Score":7.7},{"Id":474163,"Name":"从我是特种兵开始打卡","Author":"纳兰凌云","Img":"congwoshitezhongbingkaishidaka.jpg","Desc":"穿越到《我是特种兵》的世界，得到辅助引擎的支持，他逐步成为所有士兵的王，特种兵，通信兵，飞行员等等，在每一个兵种的领域他都做到了极致，成为当之无愧所有士兵的王！","CName":"历史军事","Score":6},{"Id":472802,"Name":"一不小心就无敌啦","Author":"新丰","Img":"yibuxiaoxinjiuwudila.jpg","Desc":"简介：我叫林凡，我穿越了，我要修仙，法力无边。","CName":"武侠仙侠","Score":8.8},{"Id":441590,"Name":"我的细胞监狱","Author":"穿黄衣的阿肥","Img":"wodexibaojianyu.jpg","Desc":"重生为细胞，携狱典之力，来到旧神注视下的平行世界。\r\n　　蒸汽文明、命运点数、惊悚空间、异魔鬼怪、旧神信徒\u2026\u2026\r\n　　他将以狱长之名，踏上征战旧神的旅途。\r\n　　阿肥回归正途后的全新科幻惊悚力作，质量保证。\r\n　　本书又名《从头开始》-【开局一颗头，身体全靠捡】","CName":"科幻灵异","Score":9.3},{"Id":465277,"Name":"烂柯棋缘","Author":"真费事","Img":"lankeqiyuan.jpg","Desc":"烂柯旁棋局落叶，老树间对弈无人\r\n　　兴所致天元一子，再回首山海苍茫\r\n　　\u2026\u2026\r\n　　一觉醒来，计缘成了一个破旧山神庙中的半瞎乞丐。\r\n　　实力不够嘴炮来凑，真人一柄剑，神棍一张嘴，就是计缘在这个可怕的世界安身立足的根本。","CName":"武侠仙侠","Score":8.8}]
         * Page : 1
         * HasNext : true
         */

        private int Page;
        private boolean HasNext;
        private List<BooksKSResult> BookList;

        public int getPage() {
            return Page;
        }

        public void setPage(int Page) {
            this.Page = Page;
        }

        public boolean isHasNext() {
            return HasNext;
        }

        public void setHasNext(boolean HasNext) {
            this.HasNext = HasNext;
        }

        public List<BooksKSResult> getBookList() {
            return BookList;
        }

        public void setBookList(List<BooksKSResult> BookList) {
            this.BookList = BookList;
        }

    }
}
