package com.yuhang.novel.pirate.repository.network.data.kanshu.result;

import com.yuhang.novel.pirate.repository.database.entity.StoreEntity;

import java.util.List;

public class StoreManResult {


    /**
     * status : 1
     * info : success
     * data : [{"Category":"火热新书","Books":[{"Id":484844,"Name":"神秘生物异闻录","Author":"莫道梦魂遥","Img":"shenmishengwuyiwenlu.jpg","Desc":"现代社会各地出现了神秘生物的踪迹，并且这些神秘生物袭击人类，造成了各种灾祸案件。\r\n\r\n 自年幼起，简清和便目睹父母死于巨蛇口中。为了调查真相，他加入了除祟师凌云起开设的\u201c有间事务所\u201d，在解决一桩桩离奇的案件后，当年的真相也逐步浮出水面\u2026\u2026\r\n\r\n 官方书友群：256821343，欢迎来切磋！","CName":"都市言情","Score":"6.0"},{"Id":482238,"Name":"天道编辑器","Author":"蚕茧里的牛","Img":"tiandaobianjiqi.jpg","Desc":"有一天，整个地球都穿越了。\r\n\r\n 一个陌生的宇宙，妖兽鬼怪横行，充满机缘，充满危险。\r\n\r\n 生活在现代化都市的人们，都费尽心机修炼，去适应这种剧变。\r\n\r\n 而宁直的生活，却简单多了。\r\n\r\n 猫有鱼吃就开心了，狗有肉吃就幸福了。\r\n\r\n 而宁直有羊毛薅就满足了。","CName":"玄幻奇幻","Score":"6.0"},{"Id":482139,"Name":"我师兄实在太稳健了","Author":"言归正传","Img":"woshixiongshizaitaiwenjianle.jpg","Desc":"重生在封神大战之前的上古时代，李长寿成了一个小小的炼气士，没有什么气运加身，也不是什么注定的大劫之子，他只有一个想要长生不老的修仙梦。\r\n\r\n 为了能在残酷的洪荒安身立命，他努力不沾因果，杀人必扬其灰，凡事谋而后动，从不轻易步入危险之中。\r\n\r\n 藏底牌，修遁术，炼丹毒，掌神通，不动稳如老狗，一动石破天惊，动后悄声走人。\r\n\r\n 本来李长寿规划中，自己会一直躲在山中平安无事的修行成仙，直到有一年，他的老","CName":"武侠仙侠","Score":"6.0"},{"Id":481532,"Name":"魔临","Author":"纯洁滴小龙","Img":"molin.jpg","Desc":"这个世界一直流传着这样子的一个传说：\r\n\r\n 终有一日，魔王会降临于这个世界，魔王的麾下，有七尊恐怖的魔头，他们，将带给这个世界绝望的黑暗。","CName":"玄幻奇幻","Score":"9.0"},{"Id":480779,"Name":"汉阙","Author":"七月新番","Img":"hanque.jpg","Desc":"蓦然回首千年，汉家宫阙依旧！\r\n\r\n 时值汉昭帝元凤三年，朝中权臣当道，外有匈奴未灭，丝路不绝如缕\u2026\u2026\r\n\r\n 卫霍虽没，但汉家儿郎的开拓精神，却永息，新的英雄，正呼之欲出！\r\n\r\n 敦煌戈壁，名为悬泉置的驿站里，微末小吏任弘投笔怒喝曰：\r\n\r\n \u201c大丈夫无它志略，犹当效张骞、傅介子立功异域，以取封侯，安能久事笔砚间乎？\u201d\r\n\r\n 书友群：567351610.","CName":"历史军事","Score":"8.0"},{"Id":465277,"Name":"烂柯棋缘","Author":"真费事","Img":"lankeqiyuan.jpg","Desc":"烂柯旁棋局落叶，老树间对弈无人\r\n\r\n 兴所致天元一子，再回首山海苍茫\r\n\r\n \u2026\u2026\r\n\r\n 一觉醒来，计缘成了一个破旧山神庙中的半瞎乞丐。\r\n\r\n 实力不够嘴炮来凑，真人一柄剑，神棍一张嘴，就是计缘在这个可怕的世界安身立足的根本。","CName":"武侠仙侠","Score":"8.3"}]},{"Category":"热门连载","Books":[{"Id":472802,"Name":"一不小心就无敌啦","Author":"新丰","Img":"yibuxiaoxinjiuwudila.jpg","Desc":"简介：我叫林凡，我穿越了，我要修仙，法力无边。","CName":"武侠仙侠","Score":"9.4"},{"Id":480759,"Name":"出道就是巅峰怎么办","Author":"杯中红茶","Img":"chudaojiushidianfengzenmeban.jpg","Desc":"重生睁开眼发现自己竟然穿越到平行世界落魄冠军中单的身上，而且最糟糕的是马上要上场打比赛了！？作为一条遨游在黑铁的咸鱼，却要面对一群职业选手，余乐感觉压力很大。\u201c叮，您的新手大礼包已到账，请注意查收！\u201d然而他发现别人眼中的巅峰，只是他一个微不足道的起点。最厉害的影帝，最赚钱的导演，最年轻的首","CName":"网游竞技","Score":"6.0"},{"Id":423159,"Name":"赝太子","Author":"荆柯守","Img":"yantaizi.jpg","Desc":"苏子籍读完，站在窗前若有所思看去，这时黄昏，古代的县城，没有苏子籍想的简陋，远远能看见城墙并不算高，就两丈，规模不大，但行人极多，算得上人烟稠密，街巷店铺林立，小贩、货郎叫卖不绝，雪都被踩得积实，店铺的雪都扫了，有的店铺甚至堆垛成雪狮、雪象招徕顾客，一派生气。","CName":"武侠仙侠","Score":"9.2"},{"Id":472242,"Name":"明天下","Author":"孑与2","Img":"mingtianxia.jpg","Desc":"明末的历史纷乱混杂，堪称是一段由一些有着强大个人魅力的人书写成的历史。\r\n\r\n 不论是李自成，还是张献忠这些叛逆者，还是崇祯，袁崇焕，这些当权者，亦或是吴三桂，耿精忠这些背叛者，每个人身上都有很多的故事，就是因为有了这些精彩的故事，明末的历史才变得大气起磅礴，波澜起伏。\r\n\r\n 想要把这一段历史写好，自然要描绘出一个个活生生的人物，不论他的立场如何，我们站在历史长河的边缘上旁观，他们不过是这条长河里的","CName":"历史军事","Score":"8.4"},{"Id":478164,"Name":"水果大佬","Author":"二蛇","Img":"shuiguodalao.jpg","Desc":"农村青年偶得一个水果app，从此走上人生巅峰！","CName":"都市言情","Score":"6.0"},{"Id":9143,"Name":"最强狂兵","Author":"烈焰滔滔","Img":"zuiqiangkuangbing.jpg","Desc":"一代兵王含恨离开部队，销声匿迹几年后，逆天强者强势回归都市，再度掀起血雨腥风！简单粗暴是我的行事艺术，不服就干是我的生活态度！看顶级狂少如何纵横都市，书写属于他的天王传奇！依旧极爽极热血！（老书《都市邪王》280万字完本，无断更记录，人品保证！群：287999620）","CName":"都市言情","Score":"8.1"},{"Id":473242,"Name":"天降我才必有用","Author":"石章鱼","Img":"tianjiangwocaibiyouyong.jpg","Desc":"我本天上逍遥仙，老君炉前炼金丹。\r\n\r\n 酒后失德贬凡尘，谁知人间也艰险。\r\n\r\n 尔虞我诈争名利，勾心斗角无下限。\r\n\r\n 天降我才必有用，越挫越勇越向前。\r\n\r\n 翻手为云覆手雨，我命由我不由天。","CName":"都市言情","Score":"8.0"}]},{"Category":"重磅推荐","Books":[{"Id":8975,"Name":"全职法师","Author":"乱","Img":"quanzhifashi.jpg","Desc":"一觉醒来，世界大变。\r\n\r\n 熟悉的高中传授的是魔法，告诉大家要成为一名出色的魔法师。\r\n\r\n 居住的都市之外游荡着袭击人类的魔物妖兽，虎视眈眈。\r\n\r\n 崇尚科学的世界变成了崇尚魔法，偏偏有着一样以学渣看待自己的老师，一样目光异样的同学，一样社会底层挣扎的爸爸，一样纯美却不能走路的非血缘妹妹\u2026\u2026\r\n\r\n 不过，莫凡发现绝大多数人都只能够主修一系魔法，自己却","CName":"玄幻奇幻","Score":"8.9"},{"Id":214602,"Name":"伏天氏","Author":"净无痕","Img":"futianshi.jpg","Desc":"心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！东方神州，有人皇立道统，有圣贤宗门传道，有诸侯雄踞一方王国，诸强林立，神州动乱千万载，值此之时，一代天骄叶青帝及东凰大帝横空出世，斩人皇，驭圣贤，诸侯臣服，东方神州一统！然，叶青帝忽然暴毙，世间雕像尽皆被毁，于世间除名，沦为禁忌；从此神州唯东凰大帝独尊！十五年后，东海青州城，一名为叶伏天的少年，开启了他的传奇之路\u2026","CName":"玄幻奇幻","Score":"8.9"},{"Id":272397,"Name":"天下第九","Author":"鹅是老五","Img":"tianxiadijiu.jpg","Desc":"修仙觅长生，热血任逍遥，踏莲曳波涤剑骨，凭虚御风塑圣魂！无尽宇宙之中有八道鸿蒙道则，这八道道则每一道都被一个无上强者融合。没有人知道，宇宙之中还有第九道道则，这一道道则破开鸿蒙，无人可触。","CName":"都市言情","Score":"7.2"},{"Id":248872,"Name":"诡秘之主","Author":"爱潜水的乌贼","Img":"guimizhizhu.jpg","Desc":"蒸汽与机械的浪潮中，谁能触及非凡？历史和黑暗的迷雾里，又是谁在耳语？我从诡秘中醒来，睁眼看见这个世界：枪械，大炮，巨舰，飞空艇，差分机；魔药，占卜，诅咒，倒吊人，封印物\u2026\u2026光明依旧照耀，神秘从未远离，这是一段\u201c愚者\u201d的传说。","CName":"玄幻奇幻","Score":"9.2"},{"Id":237546,"Name":"学霸的黑科技系统","Author":"晨星LL","Img":"xuebadeheikejixitong.jpg","Desc":"\u201c系统，积分能兑钱吗？\u201d\r\n\r\n \u201c不能。\u201d\r\n\r\n \u201c干，那我要你何用！\u201d\r\n\r\n \u201c本系统能让你当上学霸，全人类的爸爸那种，你还要钱有什么用？\u201d","CName":"科幻灵异","Score":"9.0"},{"Id":253077,"Name":"黎明之剑","Author":"远瞳","Img":"limingzhijian.jpg","Desc":"高文穿越了，但穿越的时候稍微出了点问题。在某个异界大陆上空飘了十几万年之后，他觉得自己可能需要一具身体才算是成为一个完整的穿越者，但他并没想到自己好不容易成功之后竟然还需要带着这具身体从棺材里爬出来，并且面对两个吓蒙了的曾曾曾曾\u2026\u2026曾孙女。以及一个即将迎来纪元终结的世界。","CName":"科幻灵异","Score":"9.2"},{"Id":221944,"Name":"点道为止","Author":"梦入神机","Img":"diandaoweizhi.jpg","Desc":"中国功夫传承千年，春秋战国吴越论剑，先秦两汉气功导引，唐宋元明剑客拳棒好汉，明清内家拳法。尚武精神之血脉，已经融入华夏精神之中。到达现代，中国功夫更是流传到达海外，无数传统武术家在外海教学，传播中国所独有的精神气质，然而...","CName":"武侠仙侠","Score":"9.5"},{"Id":214051,"Name":"太初","Author":"高楼大厦","Img":"taichu.jpg","Desc":"一树生的万朵花，天下道门是一家。\r\n\r\n 法术千般变化，人心却亘古不变","CName":"玄幻奇幻","Score":"6.3"},{"Id":307672,"Name":"万古最强宗","Author":"江湖再见","Img":"wanguzuiqiangzong.jpg","Desc":"庄严肃穆的演武场上，掌门君常笑朗声道：\u201c我铁骨铮铮派的宗旨是什么？\u201d\r\n\r\n 台下万千弟子昂首挺胸，气吞山河道：\u201c做铁骨铮铮之人，行铁骨铮铮之事！\u201d\r\n\r\n \u201cOJBK，解散。\u201d\r\n\r\n \u201c\u2026\u2026\u201d\r\n\r\n 众弟子一脸的懵逼。","CName":"玄幻奇幻","Score":"8.3"},{"Id":421747,"Name":"暗月纪元","Author":"仐三","Img":"anyuejiyuan.jpg","Desc":"紫月升起之夜，时代颠覆之时。\r\n\r\n 茫茫黑暗中，灭亡倒计时开始...\r\n\r\n PS：开篇切入点平平无奇，整体风格暗黑，压抑。信息量大，细节多，爽感晦涩，阅读心累。做好扑街准备，慎读。\r\n\r\n 官方书友群：627900916","CName":"科幻灵异","Score":"5.7"},{"Id":356950,"Name":"手术直播间","Author":"真熊初墨","Img":"shoushuzhibojian.jpg","Desc":"一个外科的小医生，一不小心得到了系统加持，横扫医学界，妙手回春，活人无数。","CName":"都市言情","Score":"7.4"},{"Id":458402,"Name":"谍影风云","Author":"寻青藤","Img":"dieyingfengyun.jpg","Desc":"一个平凡普通的公务员，机缘巧合回到了1936年，被迫加入军统，寻找地下组织，追查日本间谍，在波澜壮阔的大时代中为祖国，为民族的解放与复兴贡献着自己的一份力量，开始了他传奇的谍海生涯。QQ群833528943，QQ全订群940510849。","CName":"历史军事","Score":"8.2"}]},{"Category":"完本精选","Books":[{"Id":279359,"Name":"全球高武","Author":"老鹰吃小鸡","Img":"quanqiugaowu.jpg","Desc":"今日头条\u2014\u2014\r\n\r\n \u201c大马宗师突破九品，征战全球！\u201d\r\n\r\n \u201c小马宗师问鼎至高，横扫欧亚！\u201d\r\n\r\n \u201c乔帮主再次出手，疑似九品大宗师境！\u201d\r\n\r\n \u201c股神宝刀未老，全球宗师榜再入前十！\u201d\r\n\r\n \u201c\u2026\u2026\u201d\r\n\r\n 看着一条条新闻闪现，方平心好累，这剧本不对啊！","CName":"都市言情","Score":"9.0"},{"Id":3925,"Name":"全职高手","Author":"蝴蝶蓝","Img":"quanzhigaoshou.jpg","Desc":"勾心斗角之后，谁夺走了我的荣耀？（第一章）风雨飘摇之下，希望却不曾破灭。（开新区了）花团锦簇之中，没有迷失了方向。（哥是高手）万众瞩目之前，我，就在这里回归了！（微微一笑）人情冷暖。（请字幕君交错红色大字放出）谜。（最大号）荣耀。（本书游戏的名字）王者归来。（本书主线）主角：蝴蝶蓝故事讲述网游荣耀中被誉为教科书级别的顶尖高手叶修，因为种种原因遭到俱乐部的驱逐，离开职业圈的他寄身于一家网吧成了一个小小的网管，但是，拥有十年游戏经验的他，在荣耀新开的第十区重新投入了游戏，带着对往昔的回忆，和一把未完成的自制武器，开始了重返巅峰之路。","CName":"玄幻奇幻","Score":"9.2"},{"Id":425986,"Name":"大宋北斗司","Author":"月关","Img":"dasongbeidousi.jpg","Desc":"大宋皇城，不死太岁，咆哮随风，狂化瑶光，傀儡开阳，无人识得真面的隐光，始终不变的洞明，共同运转着这个大宋最神秘的机构－－－－北斗司。妖狐、神仙、闪电人，西湖蛇妖，酆都鬼行，诸般异状，一一征服。","CName":"历史军事","Score":"5.7"},{"Id":447,"Name":"仙逆","Author":"耳根","Img":"447.jpg","Desc":"一个平庸的山村少年，几经转折最终踏入修仙门派，他如何以平凡的资质修得仙法，如何一步一步走向巅峰，跻身枭雄、宗师之列，谱下一曲逆天的仙道之路。\n......","CName":"武侠仙侠","Score":"9.1"},{"Id":247700,"Name":"死亡通知单","Author":"周浩晖","Img":"siwangtongzhidan.jpg","Desc":"本书是周浩晖的\u201c刑警罗飞\u201d系列第四部。主人公罗飞，一个充满传奇性的警探，他拥有着异于常人的敏锐洞察力与沉着冷静的思考力，他的兴趣在于侦破各种离奇诡异的案件，他总在寻找各种问题的答案。在作者的精心刻画下罗飞的形象颇具鲜明，并具有了不俗的人格魅力。十八年前，一起离奇的爆炸案，两个本可大有作为的年轻生命就此消亡，只留给死者的恋人和好友十八年的追念和自责十八年后，爆炸案凶手再次现身网络，以Eumenide","CName":"科幻灵异","Score":"6.0"},{"Id":3143,"Name":"斗破苍穹","Author":"天蚕土豆","Img":"doupocangqiong.jpg","Desc":"这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！新书刚开，请各位兄弟多多支持，用推荐票和收藏，砸烂偶吧.^_^新书等级制度：斗者，斗师，大斗师，斗灵，斗王，斗皇，斗宗，斗尊，斗圣，斗帝。","CName":"玄幻奇幻","Score":"8.1"}]},{"Category":"分类导航","Categories":[{"CategoryName":"玄幻奇幻","CategoryId":1},{"CategoryName":"武侠仙侠","CategoryId":2},{"CategoryName":"都市言情","CategoryId":3},{"CategoryName":"女生频道","CategoryId":7}]},{"Category":"重推书单","BookList":{"ImgUrl":"https://imgapi.jiaston.com/shudan/images/36047.jpg","ListId":36047,"Title":"奇葩主角的上下五千年","Description":"唐尧虞舜夏商周，春秋战国\u2026今天穿越哪个朝代呢？好难选啊！"}}]
     */

    private int status;
    private String info;
    private List<StoreEntity> data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public List<StoreEntity> getData() {
        return data;
    }

    public void setData(List<StoreEntity> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * Category : 火热新书
         * Books : [{"Id":484844,"Name":"神秘生物异闻录","Author":"莫道梦魂遥","Img":"shenmishengwuyiwenlu.jpg","Desc":"现代社会各地出现了神秘生物的踪迹，并且这些神秘生物袭击人类，造成了各种灾祸案件。\r\n\r\n 自年幼起，简清和便目睹父母死于巨蛇口中。为了调查真相，他加入了除祟师凌云起开设的\u201c有间事务所\u201d，在解决一桩桩离奇的案件后，当年的真相也逐步浮出水面\u2026\u2026\r\n\r\n 官方书友群：256821343，欢迎来切磋！","CName":"都市言情","Score":"6.0"},{"Id":482238,"Name":"天道编辑器","Author":"蚕茧里的牛","Img":"tiandaobianjiqi.jpg","Desc":"有一天，整个地球都穿越了。\r\n\r\n 一个陌生的宇宙，妖兽鬼怪横行，充满机缘，充满危险。\r\n\r\n 生活在现代化都市的人们，都费尽心机修炼，去适应这种剧变。\r\n\r\n 而宁直的生活，却简单多了。\r\n\r\n 猫有鱼吃就开心了，狗有肉吃就幸福了。\r\n\r\n 而宁直有羊毛薅就满足了。","CName":"玄幻奇幻","Score":"6.0"},{"Id":482139,"Name":"我师兄实在太稳健了","Author":"言归正传","Img":"woshixiongshizaitaiwenjianle.jpg","Desc":"重生在封神大战之前的上古时代，李长寿成了一个小小的炼气士，没有什么气运加身，也不是什么注定的大劫之子，他只有一个想要长生不老的修仙梦。\r\n\r\n 为了能在残酷的洪荒安身立命，他努力不沾因果，杀人必扬其灰，凡事谋而后动，从不轻易步入危险之中。\r\n\r\n 藏底牌，修遁术，炼丹毒，掌神通，不动稳如老狗，一动石破天惊，动后悄声走人。\r\n\r\n 本来李长寿规划中，自己会一直躲在山中平安无事的修行成仙，直到有一年，他的老","CName":"武侠仙侠","Score":"6.0"},{"Id":481532,"Name":"魔临","Author":"纯洁滴小龙","Img":"molin.jpg","Desc":"这个世界一直流传着这样子的一个传说：\r\n\r\n 终有一日，魔王会降临于这个世界，魔王的麾下，有七尊恐怖的魔头，他们，将带给这个世界绝望的黑暗。","CName":"玄幻奇幻","Score":"9.0"},{"Id":480779,"Name":"汉阙","Author":"七月新番","Img":"hanque.jpg","Desc":"蓦然回首千年，汉家宫阙依旧！\r\n\r\n 时值汉昭帝元凤三年，朝中权臣当道，外有匈奴未灭，丝路不绝如缕\u2026\u2026\r\n\r\n 卫霍虽没，但汉家儿郎的开拓精神，却永息，新的英雄，正呼之欲出！\r\n\r\n 敦煌戈壁，名为悬泉置的驿站里，微末小吏任弘投笔怒喝曰：\r\n\r\n \u201c大丈夫无它志略，犹当效张骞、傅介子立功异域，以取封侯，安能久事笔砚间乎？\u201d\r\n\r\n 书友群：567351610.","CName":"历史军事","Score":"8.0"},{"Id":465277,"Name":"烂柯棋缘","Author":"真费事","Img":"lankeqiyuan.jpg","Desc":"烂柯旁棋局落叶，老树间对弈无人\r\n\r\n 兴所致天元一子，再回首山海苍茫\r\n\r\n \u2026\u2026\r\n\r\n 一觉醒来，计缘成了一个破旧山神庙中的半瞎乞丐。\r\n\r\n 实力不够嘴炮来凑，真人一柄剑，神棍一张嘴，就是计缘在这个可怕的世界安身立足的根本。","CName":"武侠仙侠","Score":"8.3"}]
         * Categories : [{"CategoryName":"玄幻奇幻","CategoryId":1},{"CategoryName":"武侠仙侠","CategoryId":2},{"CategoryName":"都市言情","CategoryId":3},{"CategoryName":"女生频道","CategoryId":7}]
         * BookList : {"ImgUrl":"https://imgapi.jiaston.com/shudan/images/36047.jpg","ListId":36047,"Title":"奇葩主角的上下五千年","Description":"唐尧虞舜夏商周，春秋战国\u2026今天穿越哪个朝代呢？好难选啊！"}
         */

        private String Category;
        private List<BooksKSResult> Books;

        public String getCategory() {
            return Category;
        }

        public void setCategory(String Category) {
            this.Category = Category;
        }

        public List<BooksKSResult> getBooks() {
            return Books;
        }

        public void setBooks(List<BooksKSResult> Books) {
            this.Books = Books;
        }


    }
}
